In [6]:
import pandas as pd
df = pd.read_csv("wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [8]:
df.age.corr(df.earn)

0.07400349177836055

In [11]:
df_info = df[["earn", "height", "age"]]
df_info.head(10)

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43
5  15313.352901   64.53   30
6  47104.171821   61.54   53
7  50960.054282   73.29   50
8   3212.649556   72.24   25
9  42996.637884   72.40   30

In [12]:
df_info.corrwith(df.earn)

earn      1.000000
height    0.291600
age       0.074003
dtype: float64

In [14]:
df.corr()

            earn    height        ed       age
earn    1.000000  0.291600  0.350374  0.074003
height  0.291600  1.000000  0.114047 -0.133727
ed      0.350374  0.114047  1.000000 -0.129802
age     0.074003 -0.133727 -0.129802  1.000000

In [16]:
df.age[df.age < 50]

0       49
2       33
4       43
5       30
8       25
9       30
12      38
13      31
15      31
16      39
18      33
19      48
20      25
22      39
24      25
25      26
26      45
27      49
28      39
29      25
31      48
32      42
34      37
35      23
36      29
37      37
38      43
39      35
40      30
42      35
        ..
1335    33
1336    33
1337    36
1339    37
1341    43
1342    34
1343    37
1344    43
1346    36
1347    28
1348    47
1351    41
1353    47
1354    31
1355    30
1356    25
1357    49
1358    44
1359    43
1360    43
1361    33
1363    25
1364    43
1365    34
1367    41
1369    24
1373    40
1374    33
1376    37
1378    31
Name: age, Length: 916, dtype: int64

In [15]:
df.age[df.age < 50].corr(df.earn)

0.3056056987781033